// Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

void Polindrome5(int num)
{
    if( num % 10 == num / 10000 && (num/10) %10 == (num/1000)%10)
    {
        Console.WriteLine("Да. Это число является палиндромом.");
    }
    else
    {
        Console.WriteLine("Нет. Это число не является палиндромом.");
    }
}
Console.WriteLine("Введите пятизначное число: ");
int num = Convert.ToInt32(Console.ReadLine());
if(num > 99999 || num < 10000)
{
    Console.WriteLine("Это не пятизначное число!");
}
else
{
    Polindrome5(num);
}




// Задача 21: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53

// Задача 23: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
