// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.
/*
void ShowNatural(int n)
{
    Console.Write(n + " ");
    if(n > 1) ShowNatural(n - 1);
}
Console.WriteLine("Введите натуральное число: ");
int n = Convert.ToInt32(Console.ReadLine());
ShowNatural(n);
*/

